Перем юТест;

Функция ПолучитьСписокТестов(Знач ЮнитТестирование) Экспорт

	юТест = ЮнитТестирование;

	МассивТестов = Новый Массив;
	МассивТестов.Добавить("ТестПроверкаСхемаКакМассивСОшибками");

	Возврат МассивТестов;

КонецФункции

#Область Тесты

Процедура ТестПроверкаСхемаКакМассивСОшибками() Экспорт

	ПроверяемаяМодель = Api3StatResponse();
	
	ПроверяемаяМодель[0].limit = "5000";

	ОжидаемыеОшибки = Новый Массив;
	ОжидаемыеОшибки.Добавить("Некорректный тип свойства ""limit"" (Лимит). Ожидается тип ""Число"", передан тип ""Строка""."); // BSLLS:LineLength-off

	ИмяФайла = ТекущийСценарий().Каталог + "\КонтурФокус.json";
	ТекстСпецификации = ТекстСпецификацииИзФайла(ИмяФайла); 
	
	ОшибкиПроверкиМоделиДанныхПоСпецификации = Фасеты.ОшибкиПроверкиМоделиДанныхПоСпецификации(ПроверяемаяМодель,
		"Api3StatResponse", ТекстСпецификации);

	Для Каждого ОжидаемаяОшибка Из ОжидаемыеОшибки Цикл

		ОшибкаВРезультате = ОшибкиПроверкиМоделиДанныхПоСпецификации.Найти(ОжидаемаяОшибка);
		Если ОшибкаВРезультате = Неопределено Тогда
			ТекстОшибки = СтрШаблон("Не возвращена ошибка: %1", ОжидаемаяОшибка);

			ВызватьИсключение ТекстОшибки;
		КонецЕсли;

		ОшибкиПроверкиМоделиДанныхПоСпецификации.Удалить(ОшибкаВРезультате);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОшибкиПроверкиМоделиДанныхПоСпецификации) Тогда

		ТекстОшибки = СтрШаблон("Возвращены лишние ошибки: %1", 
			СтрСоединить(ОшибкиПроверкиМоделиДанныхПоСпецификации, Символы.ПС));

		ВызватьИсключение ТекстОшибки;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстСпецификацииИзФайла(Знач ИмяФайла)
	
	ТекстСпецификацииИзФайла = "";

	ТекстовыйДокумент   = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайла, КодировкаТекста.UTF8);
	ТекстСпецификацииИзФайла = ТекстовыйДокумент.ПолучитьТекст();

	Возврат ТекстСпецификацииИзФайла;

КонецФункции

#Область КорректныеМоделиДанных

Функция Api3StatResponse()

	МодельДанных = Новый Массив;

	ОбъектМодели = Новый Структура;

	ОбъектМодели.Вставить("methodName", "api3/analytics");
    ОбъектМодели.Вставить("periodStartDate", "string");
    ОбъектМодели.Вставить("periodEndDate", "string");
    ОбъектМодели.Вставить("limitType", "LegalEntities");
    ОбъектМодели.Вставить("limit", 5000);
    ОбъектМодели.Вставить("spent", 1000);
	
	МодельДанных.Добавить(ОбъектМодели);
	
	ОбъектМодели = Новый Структура;

	ОбъектМодели.Вставить("methodName", "api3/analytics");
    ОбъектМодели.Вставить("periodStartDate", "string");
    ОбъектМодели.Вставить("periodEndDate", "string");
    ОбъектМодели.Вставить("limitType", "LegalEntities");
    ОбъектМодели.Вставить("limit", 5000);
    ОбъектМодели.Вставить("spent", 1000);
	
	МодельДанных.Добавить(ОбъектМодели);

	Возврат МодельДанных;

КонецФункции

#КонецОбласти

#КонецОбласти